In [2]:
import sqlite3

In [3]:
db=sqlite3.connect('School.sqlite')
db

In [4]:
cur=db.cursor()

In [5]:
#for creating the table 
sql_create=('Create table Student (RollNumber int Primary Key,Name Text,Age int)')
cur.execute(sql_create)

In [6]:
#for inserting the row
sql_insert=('Insert into Student values(101,"Aman",20)')
cur.execute(sql_insert)

In [7]:
#We have to commit the database
db.commit()

In [9]:
sql_insert=('Insert into Student values(102,"Naman",22)')
cur.execute(sql_insert)

In [10]:
db.commit()

Create an Employee SQLite Database for Investment Firm and in that Database create EmployeeDetail table with columns names employeeid(Primary Key), name, age, department, and salary. Now add the value in Employee_Detail table of given employee

In [25]:
import sqlite3

db=sqlite3.connect('Employee.sqlite')
db

In [13]:
cur=db.cursor()
cur

In [15]:
#creating a table
create=('create table Employee_Detail (employee_id int Primary Key,name text,age int,department text,salary int)')
cur.execute(create)

In [16]:
insert=('insert into Employee_detail values(100,"Rishav",25,"Marketing",50000),(101,"Abhishek",26,"Operations",60000),(102,"Aman",24,"Human Resource",74000)')
cur.execute(insert)

In [17]:
db.commit()

Video Class Work

In [18]:
db=sqlite3.connect('School.sqlite')
db

In [19]:
cur=db.cursor()

In [20]:
cur.execute('Insert into Student values(103,"Mohit",24)')

In [21]:
db.commit()

In [33]:
#Pass as a variable
rollNumber=104
Name="Nikhil"
Age=34
cur.execute('Insert into Student values(?,?,?)',(rollNumber,Name,Age))

In [34]:
db.commit()

In [29]:
#pass insert the multiple rows
values=[(105,"Nidhi",20),(106,"Manisha",21),(107,"Ankush",22)]
cur.executemany('Insert into Student values(?,?,?)',values)

In [30]:
db.commit()

In [31]:
#for updating
cur.execute('update Student set age=30 where rollnumber=103')
db.commit()

In [32]:
#for deleting
cur.execute('Delete from Student where rollnumber=104')
db.commit()

In [38]:
import sqlite3

db=sqlite3.connect('School.sqlite')
cur=db.cursor()

In [41]:
#for fetching the result using cursor
cur.execute("Select * from Student")

In [40]:
for row in cur:
    print(row)

(101, 'Aman', 20)
(102, 'Naman', 22)
(103, 'Mohit', 30)
(105, 'Nidhi', 20)
(106, 'Manisha', 21)
(107, 'Ankush', 22)
(104, 'Nikhil', 34)

In [44]:
#Another method using fetchone
cur.execute("Select * from Student")
cur.fetchone()

(101, 'Aman', 20)

In [45]:
#Another method using fetchone
cur.execute("Select * from Student")
print(cur.fetchone())
print(cur.fetchone())

(101, 'Aman', 20)
(102, 'Naman', 22)

In [50]:
#Another method using fetchmany
cur.execute("Select * from Student")
cur.fetchmany(3)

[(101, 'Aman', 20), (102, 'Naman', 22), (103, 'Mohit', 30)]

In [47]:
#Another method using fetchmany
cur.execute("Select * from Student")
print(cur.fetchmany())

[(101, 'Aman', 20)]

In [53]:
#Another method using fetchall
cur.execute("Select * from Student")
cur.fetchall()

[(101, 'Aman', 20),
 (102, 'Naman', 22),
 (103, 'Mohit', 30),
 (105, 'Nidhi', 20),
 (106, 'Manisha', 21),
 (107, 'Ankush', 22),
 (104, 'Nikhil', 34)]

In [55]:
#Another method using fetchall
cur.execute("Select * from Student where rollnumber>103")
cur.fetchall()

[(104, 'Nikhil', 34),
 (105, 'Nidhi', 20),
 (106, 'Manisha', 21),
 (107, 'Ankush', 22)]

In [56]:
#Another method using fetchall
cur.execute("Select * from Student where name like 'A%'")
cur.fetchall()

[(101, 'Aman', 20), (107, 'Ankush', 22)]

In [58]:
import sqlite3
import pandas as pd

db=sqlite3.connect('School.sqlite')
db

In [82]:
#frame in pandas Data Frame
df=pd.read_sql_query("Select * from Student",db)
df

   index  RollNumber     Name  Age Address
0      0         101     Aman   20    Test
1      1         102    Naman   22    Test
2      2         103    Mohit   30    Test
3      3         105    Nidhi   20    Test
4      4         106  Manisha   21    Test
5      5         107   Ankush   22    Test
6      6         104   Nikhil   34    Test

In [60]:
df[df['Age']>21]

   RollNumber    Name  Age
1         102   Naman   22
2         103   Mohit   30
5         107  Ankush   22
6         104  Nikhil   34

In [61]:
#Create a table using pandas
df2=pd.DataFrame([[201,"Aman","English",20000],[202,"Komal","Maths",22000],[203,"Mahesh","Science",23000]],
                columns=["ID","Name","Course","Salary"])
df2

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202   Komal    Maths   22000
2  203  Mahesh  Science   23000

In [62]:
#converting the dataframe to sql table and store in databases
df2.to_sql("Faculty",db)

In [64]:
df['Address']="Test"
df.to_sql("Student",db,if_exists="replace")

In [68]:
df

   RollNumber     Name  Age Address
0         101     Aman   20    Test
1         102    Naman   22    Test
2         103    Mohit   30    Test
3         105    Nidhi   20    Test
4         106  Manisha   21    Test
5         107   Ankush   22    Test
6         104   Nikhil   34    Test

In [88]:
df.iloc[0:4,0:]

   index  RollNumber   Name  Age Address
0      0         101   Aman   20    Test
1      1         102  Naman   22    Test
2      2         103  Mohit   30    Test
3      3         105  Nidhi   20    Test

In [12]:
val=101
cur.execute("Select name from Student where rollnumber=?",(val,))